modm-ext/archive-stmicro-svd/header_stm32h733vgh6.svd
      <register>
        <name>PIDR4</name>
        <addressOffset>0xfd0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>JEP106CON</name>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>4KCOUNT</name>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>PIDR0</name>
        <addressOffset>0xfe0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PARTNUM</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>PIDR1</name>
        <addressOffset>0xfe4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PARTNUM</name>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>JEP106ID</name>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>PIDR2</name>
        <addressOffset>0xfe8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>JEP106ID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>JEDEC</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>REVISION</name>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>PIDR3</name>
        <addressOffset>0xfec</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CMOD</name>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>REVAND</name>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CIDR0</name>
        <addressOffset>0xff0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CIDR1</name>
        <addressOffset>0xff4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CIDR2</name>
        <addressOffset>0xff8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CIDR3</name>
        <addressOffset>0xffc</addressOffset>
        <size>0x20</size>
      </register>
    </peripheral>
  </peripherals>
</device>
